xuchen-tech/hdd_i2c/i2c_target_LP_MSPM0G3507_freertos_ticlang/ti_drivers_config.h
/*
 * Copyright (c) 2023-2024, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *  ======== ti_drivers_config.h ========
 *  Configured TI-Drivers module declarations
 *
 *  The macros defines herein are intended for use by applications which
 *  directly include this header. These macros should NOT be hard coded or
 *  copied into library source code.
 *
 *  Symbols declared as const are intended for use with libraries.
 *  Library source code must extern the correct symbol--which is resolved
 *  when the application is linked.
 *
 */
#ifndef ti_drivers_config_h
#define ti_drivers_config_h

#define CONFIG_LP_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/DeviceFamily.h>

#include <stdint.h>
#include <stdio.h>
#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_gpio.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>
#include <ti/drivers/I2CTarget.h>
#include <ti/drivers/UART.h>
#include <ti/drivers/ADC.h>
#include <ti/drivers/dma/DMAMSPM0.h>
#include <ti/drivers/uart/UARTMSPM0.h>

/* support C++ sources */
#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== ADC ========
 */
#define ADC_0_INST ADC0
/* PA26_ADC0_1 */
extern const uint_least8_t CONFIG_ADC_0_CONST;
#define CONFIG_ADC_0 0

#define I2C_CLOCK_MHZ 32

/*
 *  ======== GPIO ========
 */

 /* Owned by CONFIG_ADC_0 as  */
extern const uint_least8_t CONFIG_GPIO_ADC_0_AIN_CONST;
/* This is actual port pin */
#define CONFIG_GPIO_ADC_0_AIN (26)
#define CONFIG_GPIO_ADC_0_AIN_PINCM (IOMUX_PINCM59)
#define CONFIG_GPIO_ADC_0_AIN_PINMUX (IOMUX_PINCM59_PF_GPIOA_DIO26)

extern const uint_least8_t CONFIG_GPIO_LED_0_CONST;
#define CONFIG_GPIO_LED_0 1  //PA1
#define CONFIG_GPIO_LED_0_IOMUX (IOMUX_PINCM2)

extern const uint_least8_t CONFIG_GPIO_LED_1_CONST;
#define CONFIG_GPIO_LED_1 58  //PB26
#define CONFIG_GPIO_LED_1_IOMUX (IOMUX_PINCM57)

/* The range of pins available on this device */
extern const uint_least8_t GPIO_pinLowerBound;
extern const uint_least8_t GPIO_pinUpperBound;

/* LEDs are active low */
#define CONFIG_GPIO_LED_0_ON (0)
#define CONFIG_GPIO_LED_0_OFF (1)

#define CONFIG_GPIO_LED_1_ON (1)
#define CONFIG_GPIO_LED_1_OFF (0)


/*
 *  ======== I2C ========
 */
extern const uint_least8_t CONFIG_I2C_CONTROLLER_CONST;
#define CONFIG_I2C_0 0

/*
 *  ======== I2C ========
 */

extern const uint_least8_t CONFIG_I2C_TARGET_CONST;
#define CONFIG_I2C_TARGET_0 0
#define CONFIG_TI_DRIVERS_I2C_COUNT 1

/* ======== I2C Addresses and Speeds ======== */
#include <ti/drivers/I2C.h>

/* ---- CONFIG_I2C_TARGET I2C bus components ---- */

/* CONFIG_I2C_TARGET max speed (supported by all components) */
#define CONFIG_I2C_TARGET_MAXSPEED (400U) /* kbps */
#define CONFIG_I2C_TARGET_MAXBITRATE ((I2C_BitRate) I2C_400kHz)

/* Defines for I2C0 */
#define I2C0_INST I2C0
#define I2C0_INST_IRQHandler I2C0_IRQHandler
#define I2C0_INST_INT_IRQN I2C0_INT_IRQn

#define GPIO_I2C0_SDA_PIN (10)
#define GPIO_I2C0_IOMUX_SDA (IOMUX_PINCM21)
#define GPIO_I2C0_IOMUX_SDA_FUNC IOMUX_PINCM21_PF_I2C0_SDA

#define GPIO_I2C0_SCL_PIN (11)
#define GPIO_I2C0_IOMUX_SCL (IOMUX_PINCM22)
#define GPIO_I2C0_IOMUX_SCL_FUNC IOMUX_PINCM22_PF_I2C0_SCL

/* Defines for I2C1 */
#define I2C1_INST I2C1
#define I2C1_INST_IRQHandler I2C1_IRQHandler
#define I2C1_INST_INT_IRQN I2C1_INT_IRQn

#define GPIO_I2C1_SDA_PIN (16)
#define GPIO_I2C1_IOMUX_SDA (IOMUX_PINCM38)
#define GPIO_I2C1_IOMUX_SDA_FUNC IOMUX_PINCM38_PF_I2C1_SDA

#define GPIO_I2C1_SCL_PIN (15)
#define GPIO_I2C1_IOMUX_SCL (IOMUX_PINCM37)
#define GPIO_I2C1_IOMUX_SCL_FUNC IOMUX_PINCM37_PF_I2C1_SCL

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */

/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)

/* Defines for CONFIG_UART_0 */
#define CONFIG_UART_0_INST                                                 UART0
#define CONFIG_UART_BAUD_RATE                                           (115200)

/* Port definition for Pin Group GPIO_GRP_0 */
#define GPIO_GRP_0_PORT                                                  (GPIOA)

/* Defines for PIN_0: GPIOA.0 with pinCMx 1 on package pin 33 */
#define GPIO_GRP_0_PIN_0_PIN                                     (DL_GPIO_PIN_0)
#define GPIO_GRP_0_PIN_0_IOMUX                                    (IOMUX_PINCM1)

/* Port definition for Pin Group GPIO_LEDS */
#define GPIO_LEDS_PORT                                                   (GPIOB)

/* Defines for USER_LED_1: GPIOB.26 with pinCMx 57 on package pin 28 */
#define GPIO_LEDS_USER_LED_1_PIN                                (DL_GPIO_PIN_26)
#define GPIO_LEDS_USER_LED_1_IOMUX                               (IOMUX_PINCM57)

/* clang-format on */

/*
 *  ======== Board_init ========
 *  Perform all required TI-Drivers initialization
 *
 *  This function should be called once at a point before any use of
 *  TI-Drivers.
 */
extern void Board_init(void);

/*
 *  ======== Board_initGeneral ========
 *  (deprecated)
 *
 *  Board_initGeneral() is defined purely for backward compatibility.
 *
 *  All new code should use Board_init() to do any required TI-Drivers
 *  initialization _and_ use <Driver>_init() for only where specific drivers
 *  are explicitly referenced by the application.  <Driver>_init() functions
 *  are idempotent.
 */
#define Board_initGeneral Board_init

#ifdef __cplusplus
}
#endif
#endif /* ti_drivers_config_h */
